
from db import get_collection

_dict = {
    "False": "Логическое значение — ложь",
    "None": "Отсутствующее или пустое значение",
    "True": "Логическое значение — истина",
    "and": "Логическое И",
    "as": "Задаёт другое имя для объекта",
    "assert": "Проверяет условие и сообщает об ошибке",
    "async": "Объявляет асинхронную функцию",
    "await": "Ожидает завершения асинхронной операции",
    "break": "Прерывает цикл",
    "class": "Создаёт класс",
    "continue": "Переходит к следующей итерации цикла",
    "def": "Создаёт функцию",
    "del": "Удаляет переменную или элемент",
    "elif": "Дополнительное условие",
    "else": "Выполняется, если условие не подошло",
    "except": "Обрабатывает ошибку",
    "finally": "Выполняется в конце обработки ошибки",
    "pass": "Ничего не делает",
    "for": "Цикл перебора элементов",
    "from": "Указывает источник импорта",
    "global": "Разрешает изменять глобальную переменную",
    "if": "Проверяет условие",
    "import": "Подключает модуль",
    "in": "Проверяет наличие элемента",
    "is": "Проверяет, являются ли объекты одним объектом",
    "lambda": "Создаёт короткую анонимную функцию",
    "nonlocal": "Разрешает изменять переменную внешней функции",
    "not": "Логическое НЕ",
    "or": "Логическое ИЛИ",
    "raise": "Вызывает ошибку вручную",
    "return": "Возвращает результат из функции",
    "try": "Запускает код, где возможна ошибка",
    "while": "Цикл, пока условие истинно",
    "with": "Безопасно работает с ресурсом",
    "yield": "Возвращает значение из генератора",
}


def main():
    collection = get_collection()

    for word, hint in _dict.items():
        collection.update_one(
            {"word": word},
            {
                "$setOnInsert": {
                    "word": word,
                    "category": "Python",
                    "hint": hint,
                    "difficulty": "средняя",
                    "used": False,
                    "guessed_count": 0,
                }
            },
            upsert=True,
        )

    print("Слова загружены")
    print("Всего документов:", collection.count_documents({}))


if __name__ == "__main__":
    main()
